# Pandas
**Pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series.**

In [1]:
import numpy as np
import pandas as pd

**Pandas supports two data structures:**

- Series
- Dataframe

# Series
**Series is a one-dimensional labeled array and capable of holding data of any type (integer, string, float, python objects, etc.)**

In [2]:
li=['Pankaj','Kumar','Amyra','Dastur','Renu','Kumari']

In [3]:
series=pd.Series(li)
series

0    Pankaj
1     Kumar
2     Amyra
3    Dastur
4      Renu
5    Kumari
dtype: object

In [4]:
li=[1,2,3,4,5,6]
series=pd.Series(li)
series

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [5]:
di={"One":1,"Two":2,"Three":3,"Four":4,"Five":5,"Six":6}
ser=pd.Series(di)
ser

One      1
Two      2
Three    3
Four     4
Five     5
Six      6
dtype: int64

In [6]:
ser=pd.Series(np.random.rand(10))
ser

0    0.345875
1    0.754139
2    0.764221
3    0.815469
4    0.421293
5    0.554869
6    0.522188
7    0.669739
8    0.038227
9    0.336944
dtype: float64

In [7]:
# The index of the series can be customized by
ser=pd.Series(np.random.rand(10),index=['a', 'b', 'c', 'd', 'e','f','g','h','i','j'])
ser

a    0.440474
b    0.001932
c    0.333067
d    0.045065
e    0.441143
f    0.037563
g    0.671144
h    0.822161
i    0.687658
j    0.385397
dtype: float64

In [8]:
type(ser)

pandas.core.series.Series

# DataFrame
**DataFrame is a 2D data structure with columns that can be of different datatypes. It
can be seen as a table.**

In [9]:
df=pd.DataFrame(np.random.rand(334,5))
df

            0         1         2         3         4
0    0.749992  0.775634  0.469735  0.471629  0.369535
1    0.892647  0.945258  0.349572  0.266264  0.915567
2    0.527220  0.685375  0.795530  0.123892  0.176809
3    0.073399  0.637697  0.582068  0.497295  0.217634
4    0.102164  0.429950  0.125438  0.464155  0.233583
..        ...       ...       ...       ...       ...
329  0.778927  0.766396  0.871763  0.051888  0.426036
330  0.698647  0.173135  0.142482  0.903837  0.660373
331  0.387686  0.192206  0.015476  0.305862  0.723109
332  0.706589  0.132372  0.777913  0.785171  0.292978
333  0.115113  0.398366  0.911863  0.678287  0.958257

[334 rows x 5 columns]

In [10]:
df.head()

          0         1         2         3         4
0  0.749992  0.775634  0.469735  0.471629  0.369535
1  0.892647  0.945258  0.349572  0.266264  0.915567
2  0.527220  0.685375  0.795530  0.123892  0.176809
3  0.073399  0.637697  0.582068  0.497295  0.217634
4  0.102164  0.429950  0.125438  0.464155  0.233583

In [11]:
df.tail(7)

            0         1         2         3         4
327  0.882593  0.132285  0.960054  0.199723  0.581131
328  0.028975  0.162872  0.110095  0.515599  0.944905
329  0.778927  0.766396  0.871763  0.051888  0.426036
330  0.698647  0.173135  0.142482  0.903837  0.660373
331  0.387686  0.192206  0.015476  0.305862  0.723109
332  0.706589  0.132372  0.777913  0.785171  0.292978
333  0.115113  0.398366  0.911863  0.678287  0.958257

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df.shape

(334, 5)

**DataFrame can be created using a single list or a list of lists**

In [14]:
li=[78,34,56,56,35,78,90,56,78]
df=pd.DataFrame(li)
df

    0
0  78
1  34
2  56
3  56
4  35
5  78
6  90
7  56
8  78

**Creating DataFrame from dict of ndarray/lists**

In [15]:
dct={"Name":['Pankaj','Kumar','Amyra','Dastur','Renu','Kumari'],"Marks":[67,56,89,57,37,86],"Class":[4,6,3,7,5,6],
     "Passed":[True,True,True,True,False,True]
    }
df=pd.DataFrame(dct)
df

     Name  Marks  Class  Passed
0  Pankaj     67      4    True
1   Kumar     56      6    True
2   Amyra     89      3    True
3  Dastur     57      7    True
4    Renu     37      5   False
5  Kumari     86      6    True

In [16]:
# The describe() method is used for calculating some statistical data like percentile, 
# mean and std of the numerical values of the Series or DataFrame.
df.describe()

           Marks     Class
count   6.000000  6.000000
mean   65.333333  5.166667
std    19.745042  1.471960
min    37.000000  3.000000
25%    56.250000  4.250000
50%    62.000000  5.500000
75%    81.250000  6.000000
max    89.000000  7.000000

In [17]:
df.dtypes # returns data types of each column

Name      object
Marks      int64
Class      int64
Passed      bool
dtype: object

In [18]:
# The info() function is used to print a concise summary of a DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Marks   6 non-null      int64
 2   Class   6 non-null      int64
 3   Passed  6 non-null      bool
dtypes: bool(1), int64(2), object(1)
memory usage: 190.0+ bytes

In [19]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [20]:
df.columns

Index(['Name', 'Marks', 'Class', 'Passed'], dtype='object')

In [21]:
# Convert dataframe to Numpy array
df.to_numpy()

array([['Pankaj', 67, 4, True],
       ['Kumar', 56, 6, True],
       ['Amyra', 89, 3, True],
       ['Dastur', 57, 7, True],
       ['Renu', 37, 5, False],
       ['Kumari', 86, 6, True]], dtype=object)

In [22]:
df.T # It transpose the dataframe

             0      1      2       3      4       5
Name    Pankaj  Kumar  Amyra  Dastur   Renu  Kumari
Marks       67     56     89      57     37      86
Class        4      6      3       7      5       6
Passed    True   True   True    True  False    True

In [23]:
df.sort_index(axis=0,ascending=False) # Sorts the index

     Name  Marks  Class  Passed
5  Kumari     86      6    True
4    Renu     37      5   False
3  Dastur     57      7    True
2   Amyra     89      3    True
1   Kumar     56      6    True
0  Pankaj     67      4    True

In [24]:
df.sort_index(axis=1)

   Class  Marks    Name  Passed
0      4     67  Pankaj    True
1      6     56   Kumar    True
2      3     89   Amyra    True
3      7     57  Dastur    True
4      5     37    Renu   False
5      6     86  Kumari    True

In [25]:
df.sort_index(axis=1,ascending=False)

   Passed    Name  Marks  Class
0    True  Pankaj     67      4
1    True   Kumar     56      6
2    True   Amyra     89      3
3    True  Dastur     57      7
4   False    Renu     37      5
5    True  Kumari     86      6

In [26]:
type(df['Name'])  # So we can say that dataFrame is the combination of series

pandas.core.series.Series

In [27]:
#  Return a Series containing counts of unique values.
df['Class'].value_counts()

6    2
7    1
5    1
4    1
3    1
Name: Class, dtype: int64

In [28]:
newdf=df # It is just like a view

In [29]:
newdf

     Name  Marks  Class  Passed
0  Pankaj     67      4    True
1   Kumar     56      6    True
2   Amyra     89      3    True
3  Dastur     57      7    True
4    Renu     37      5   False
5  Kumari     86      6    True

In [30]:
newdf['Marks'][0]=66  # if we change in the view that change will also be reflected in the original dataframe

c:\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [31]:
df

     Name  Marks  Class  Passed
0  Pankaj     66      4    True
1   Kumar     56      6    True
2   Amyra     89      3    True
3  Dastur     57      7    True
4    Renu     37      5   False
5  Kumari     86      6    True

In [32]:
newdf=df.copy()

In [33]:
newdf['Marks'][0]=61

c:\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [34]:
df # So we can see that after the copy has been created, the change is not reflected in the original dataframe

     Name  Marks  Class  Passed
0  Pankaj     66      4    True
1   Kumar     56      6    True
2   Amyra     89      3    True
3  Dastur     57      7    True
4    Renu     37      5   False
5  Kumari     86      6    True

In [35]:
# Changing a cell in the dataframe was giving a warning "SettingWithCopyWarning"
# to overcome this we use loc
df.loc[0,'Marks']=76   # same as newdf['Marks'][0]=76
df

     Name  Marks  Class  Passed
0  Pankaj     76      4    True
1   Kumar     56      6    True
2   Amyra     89      3    True
3  Dastur     57      7    True
4    Renu     37      5   False
5  Kumari     86      6    True

In [36]:
df.loc[6,'Marks']=76
df

     Name  Marks  Class Passed
0  Pankaj   76.0    4.0   True
1   Kumar   56.0    6.0   True
2   Amyra   89.0    3.0   True
3  Dastur   57.0    7.0   True
4    Renu   37.0    5.0  False
5  Kumari   86.0    6.0   True
6     NaN   76.0    NaN    NaN

In [37]:
df.loc[0,'Grade']='A'
df

     Name  Marks  Class Passed Grade
0  Pankaj   76.0    4.0   True     A
1   Kumar   56.0    6.0   True   NaN
2   Amyra   89.0    3.0   True   NaN
3  Dastur   57.0    7.0   True   NaN
4    Renu   37.0    5.0  False   NaN
5  Kumari   86.0    6.0   True   NaN
6     NaN   76.0    NaN    NaN   NaN

In [38]:
# dropping a row
df.drop(6,inplace=True)
df
# for dropping multiple rows just write the names of columns in a list

     Name  Marks  Class Passed Grade
0  Pankaj   76.0    4.0   True     A
1   Kumar   56.0    6.0   True   NaN
2   Amyra   89.0    3.0   True   NaN
3  Dastur   57.0    7.0   True   NaN
4    Renu   37.0    5.0  False   NaN
5  Kumari   86.0    6.0   True   NaN

In [39]:
# dropping a column  
df.drop('Grade',axis=1,inplace=True)
df
# for dropping multiple columns just write the names of columns in a list

     Name  Marks  Class Passed
0  Pankaj   76.0    4.0   True
1   Kumar   56.0    6.0   True
2   Amyra   89.0    3.0   True
3  Dastur   57.0    7.0   True
4    Renu   37.0    5.0  False
5  Kumari   86.0    6.0   True

In [40]:
# accesing some rows of some columns only
df.loc[[1,2,3],['Name','Marks']]

     Name  Marks
1   Kumar   56.0
2   Amyra   89.0
3  Dastur   57.0

In [41]:
# accesing all rows of some columns only
df.loc[:,['Name','Marks']]

     Name  Marks
0  Pankaj   76.0
1   Kumar   56.0
2   Amyra   89.0
3  Dastur   57.0
4    Renu   37.0
5  Kumari   86.0

In [42]:
# accesing some rows of all columns only
df.loc[[1,2,3],:]

     Name  Marks  Class Passed
1   Kumar   56.0    6.0   True
2   Amyra   89.0    3.0   True
3  Dastur   57.0    7.0   True

In [43]:
# Querying with conditions
df.loc[(df['Marks']>60)]

     Name  Marks  Class Passed
0  Pankaj   76.0    4.0   True
2   Amyra   89.0    3.0   True
5  Kumari   86.0    6.0   True

In [44]:
# Querying with conditions
df.loc[(df['Class']>5),['Name','Marks']]

     Name  Marks
1   Kumar   56.0
3  Dastur   57.0
5  Kumari   86.0

In [45]:
# Complex query with conditions
df.loc[(df['Marks']>60) & (df['Class']>5)]

     Name  Marks  Class Passed
5  Kumari   86.0    6.0   True

In [46]:
# Querying with conditions
df.loc[(df['Marks']>60),['Name','Marks']]
df.iloc[2]

Name      Amyra
Marks        89
Class         3
Passed     True
Name: 2, dtype: object

In [47]:
#retrieving rows by iloc
df.iloc[2]

Name      Amyra
Marks        89
Class         3
Passed     True
Name: 2, dtype: object

In [48]:
#retrieving cell by iloc
df.iloc[1,1]

56.0

In [49]:
# retrieving records by iloc
df.iloc[[1,2],[2,3]]

   Class Passed
1    6.0   True
2    3.0   True

In [50]:
# Reset the index of the DataFrame . It also adds an extra column named 'index' using the privious index
df.reset_index()

   index    Name  Marks  Class Passed
0      0  Pankaj   76.0    4.0   True
1      1   Kumar   56.0    6.0   True
2      2   Amyra   89.0    3.0   True
3      3  Dastur   57.0    7.0   True
4      4    Renu   37.0    5.0  False
5      5  Kumari   86.0    6.0   True

In [51]:
# to drop that index column
df.reset_index(drop=True)

     Name  Marks  Class Passed
0  Pankaj   76.0    4.0   True
1   Kumar   56.0    6.0   True
2   Amyra   89.0    3.0   True
3  Dastur   57.0    7.0   True
4    Renu   37.0    5.0  False
5  Kumari   86.0    6.0   True

In [52]:
# appending a row in an existing dataframe
newRow={"Name":"Sakshi","Marks":45,"Class":7,"Passed":True}
df=df.append(newRow,ignore_index=True)
df

     Name  Marks  Class Passed
0  Pankaj   76.0    4.0   True
1   Kumar   56.0    6.0   True
2   Amyra   89.0    3.0   True
3  Dastur   57.0    7.0   True
4    Renu   37.0    5.0  False
5  Kumari   86.0    6.0   True
6  Sakshi   45.0    7.0   True

In [53]:
newRow={"Name":"Pankaj","Marks":76,"Class":4,"Passed":True}
df=df.append(newRow,ignore_index=True)
df

     Name  Marks  Class Passed
0  Pankaj   76.0    4.0   True
1   Kumar   56.0    6.0   True
2   Amyra   89.0    3.0   True
3  Dastur   57.0    7.0   True
4    Renu   37.0    5.0  False
5  Kumari   86.0    6.0   True
6  Sakshi   45.0    7.0   True
7  Pankaj   76.0    4.0   True

In [54]:
df.drop_duplicates(inplace=True) # It will remove the duplicate rows
df

     Name  Marks  Class Passed
0  Pankaj   76.0    4.0   True
1   Kumar   56.0    6.0   True
2   Amyra   89.0    3.0   True
3  Dastur   57.0    7.0   True
4    Renu   37.0    5.0  False
5  Kumari   86.0    6.0   True
6  Sakshi   45.0    7.0   True

In [55]:
newRow={"Name":"Sinha","Marks":68,"Passed":True}
df=df.append(newRow,ignore_index=True)
df

     Name  Marks  Class Passed
0  Pankaj   76.0    4.0   True
1   Kumar   56.0    6.0   True
2   Amyra   89.0    3.0   True
3  Dastur   57.0    7.0   True
4    Renu   37.0    5.0  False
5  Kumari   86.0    6.0   True
6  Sakshi   45.0    7.0   True
7   Sinha   68.0    NaN   True

In [56]:
newRow={"Name":"Shweta","Passed":True}
df=df.append(newRow,ignore_index=True)
df

     Name  Marks  Class Passed
0  Pankaj   76.0    4.0   True
1   Kumar   56.0    6.0   True
2   Amyra   89.0    3.0   True
3  Dastur   57.0    7.0   True
4    Renu   37.0    5.0  False
5  Kumari   86.0    6.0   True
6  Sakshi   45.0    7.0   True
7   Sinha   68.0    NaN   True
8  Shweta    NaN    NaN   True

**Checking the missing data**

In [57]:
df.isnull()

    Name  Marks  Class  Passed
0  False  False  False   False
1  False  False  False   False
2  False  False  False   False
3  False  False  False   False
4  False  False  False   False
5  False  False  False   False
6  False  False  False   False
7  False  False   True   False
8  False   True   True   False

In [58]:
df.count()

Name      9
Marks     8
Class     7
Passed    9
dtype: int64

In [59]:
df.notnull().sum()
# When you use sum(), it will return the sum of every column, which adds trues(=1) and false(= 0) together
# e.g.  print(True+False+True)

# o/p:  2

Name      9
Marks     8
Class     7
Passed    9
dtype: int64

In [60]:
df.isnull().sum()

Name      0
Marks     1
Class     2
Passed    0
dtype: int64

In [61]:
# Null
np.NaN

nan

In [62]:
# Setting a complete row as Null
df.iloc[8,:]=None
df

     Name  Marks  Class Passed
0  Pankaj   76.0    4.0   True
1   Kumar   56.0    6.0   True
2   Amyra   89.0    3.0   True
3  Dastur   57.0    7.0   True
4    Renu   37.0    5.0  False
5  Kumari   86.0    6.0   True
6  Sakshi   45.0    7.0   True
7   Sinha   68.0    NaN   True
8    None    NaN    NaN   None

In [63]:
df.iloc[8,:].isnull() # None=Nan

Name      True
Marks     True
Class     True
Passed    True
Name: 8, dtype: bool

In [64]:
df.iloc[8,:]=np.NaN
df

     Name  Marks  Class Passed
0  Pankaj   76.0    4.0   True
1   Kumar   56.0    6.0   True
2   Amyra   89.0    3.0   True
3  Dastur   57.0    7.0   True
4    Renu   37.0    5.0  False
5  Kumari   86.0    6.0   True
6  Sakshi   45.0    7.0   True
7   Sinha   68.0    NaN   True
8     NaN    NaN    NaN    NaN

In [65]:
# Setting a complete column as Null
df.iloc[:,3]=None
df

     Name  Marks  Class Passed
0  Pankaj   76.0    4.0   None
1   Kumar   56.0    6.0   None
2   Amyra   89.0    3.0   None
3  Dastur   57.0    7.0   None
4    Renu   37.0    5.0   None
5  Kumari   86.0    6.0   None
6  Sakshi   45.0    7.0   None
7   Sinha   68.0    NaN   None
8     NaN    NaN    NaN   None

In [66]:
df.iloc[:,3].isnull()

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
Name: Passed, dtype: bool

**These missing values can be handled by either removing the rows
with the missing values or replacing it with some values**

In [67]:
df.dropna()

Empty DataFrame
Columns: [Name, Marks, Class, Passed]
Index: []

In [68]:
df

     Name  Marks  Class Passed
0  Pankaj   76.0    4.0   None
1   Kumar   56.0    6.0   None
2   Amyra   89.0    3.0   None
3  Dastur   57.0    7.0   None
4    Renu   37.0    5.0   None
5  Kumari   86.0    6.0   None
6  Sakshi   45.0    7.0   None
7   Sinha   68.0    NaN   None
8     NaN    NaN    NaN   None

In [69]:
df.iloc[:,2].isnull().value_counts()

False    7
True     2
Name: Class, dtype: int64

In [70]:
df

     Name  Marks  Class Passed
0  Pankaj   76.0    4.0   None
1   Kumar   56.0    6.0   None
2   Amyra   89.0    3.0   None
3  Dastur   57.0    7.0   None
4    Renu   37.0    5.0   None
5  Kumari   86.0    6.0   None
6  Sakshi   45.0    7.0   None
7   Sinha   68.0    NaN   None
8     NaN    NaN    NaN   None

In [71]:
df.dropna(how='any') # how='any' drops the row/column if ANY value is Null

Empty DataFrame
Columns: [Name, Marks, Class, Passed]
Index: []

In [72]:
df.dropna(how='all') # how='any' drops the row/column if ALL values are Null

     Name  Marks  Class Passed
0  Pankaj   76.0    4.0   None
1   Kumar   56.0    6.0   None
2   Amyra   89.0    3.0   None
3  Dastur   57.0    7.0   None
4    Renu   37.0    5.0   None
5  Kumari   86.0    6.0   None
6  Sakshi   45.0    7.0   None
7   Sinha   68.0    NaN   None

In [73]:
df.dropna(axis=1) # column wise dropping NaN if any value in a column is found as NaN the it drops the complete column

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8]

**to fill the value with forward propagation, which means that the
value previous to the null value in the column will be used to fill the null value**

In [74]:
df.fillna(method='pad')

     Name  Marks  Class Passed
0  Pankaj   76.0    4.0   None
1   Kumar   56.0    6.0   None
2   Amyra   89.0    3.0   None
3  Dastur   57.0    7.0   None
4    Renu   37.0    5.0   None
5  Kumari   86.0    6.0   None
6  Sakshi   45.0    7.0   None
7   Sinha   68.0    7.0   None
8   Sinha   68.0    7.0   None

**to fill the null values of the column with the column mean**

In [75]:
df.fillna(df.mean())

     Name  Marks     Class  Passed
0  Pankaj  76.00  4.000000     NaN
1   Kumar  56.00  6.000000     NaN
2   Amyra  89.00  3.000000     NaN
3  Dastur  57.00  7.000000     NaN
4    Renu  37.00  5.000000     NaN
5  Kumari  86.00  6.000000     NaN
6  Sakshi  45.00  7.000000     NaN
7   Sinha  68.00  5.428571     NaN
8     NaN  64.25  5.428571     NaN

In [76]:
# to fill the null values of the column with the column mean
df.fillna(df.max())

     Name  Marks  Class  Passed
0  Pankaj   76.0    4.0     NaN
1   Kumar   56.0    6.0     NaN
2   Amyra   89.0    3.0     NaN
3  Dastur   57.0    7.0     NaN
4    Renu   37.0    5.0     NaN
5  Kumari   86.0    6.0     NaN
6  Sakshi   45.0    7.0     NaN
7   Sinha   68.0    7.0     NaN
8     NaN   89.0    7.0     NaN

In [77]:
df['Name'].value_counts()

Dastur    1
Kumari    1
Pankaj    1
Renu      1
Sakshi    1
Kumar     1
Sinha     1
Amyra     1
Name: Name, dtype: int64

In [78]:
df['Name'].value_counts(dropna=False)

Dastur    1
Kumari    1
Pankaj    1
Renu      1
Sakshi    1
Kumar     1
Sinha     1
Amyra     1
NaN       1
Name: Name, dtype: int64

**Statistical functions**

In [79]:
df.describe()

           Marks     Class
count   8.000000  7.000000
mean   64.250000  5.428571
std    18.790195  1.511858
min    37.000000  3.000000
25%    53.250000  4.500000
50%    62.500000  6.000000
75%    78.500000  6.500000
max    89.000000  7.000000

In [80]:
df.min()

Marks     37.0
Class      3.0
Passed     NaN
dtype: float64

In [81]:
df.max()

Marks     89.0
Class      7.0
Passed     NaN
dtype: float64

In [82]:
df.corr()

         Marks    Class
Marks  1.00000 -0.54027
Class -0.54027  1.00000

In [83]:
df.mean()

Marks     64.250000
Class      5.428571
Passed          NaN
dtype: float64

In [84]:
df.median()

C:\Users\Pankaj Kumar\AppData\Roaming\Python\Python37\site-packages\numpy\lib\nanfunctions.py:1111: RuntimeWarning: Mean of empty slice
  return np.nanmean(a, axis, out=out, keepdims=keepdims)

Marks     62.5
Class      6.0
Passed     NaN
dtype: float64

In [85]:
df.std()

Marks     18.790195
Class      1.511858
Passed          NaN
dtype: float64

# Reading and writing Data in Pandas

**Read CSV**

In [86]:
df=pd.read_csv('Tips.csv')

In [87]:
df

    SINO  TotalBill  Tips Smoker  Day    Time  Size
0      1      16.99  1.01     No  Sun  Dinner   2.0
1      2      10.34  1.66     No  Sun  Dinner   3.0
2      3      21.01  3.50     No  Sun  Dinner   3.0
3      4      23.68  3.31     No  Sun  Dinner   2.0
4      5      24.59  3.61     No  Sun  Dinner   4.0
..   ...        ...   ...    ...  ...     ...   ...
95    96      40.17  4.73    Yes  Fri  Dinner   4.0
96    97      27.28  4.00    Yes  Fri  Dinner   2.0
97    98      12.03  1.50    Yes  Fri  Dinner   2.0
98    99      21.01  3.00    Yes  Fri  Dinner   2.0
99   100      25.10   NaN     No  NaN   Lunch   2.0

[100 rows x 7 columns]

**Write to CSV**

In [88]:
dct={"Name":['Pankaj','Kumar','Amyra','Dastur','Renu','Kumari'],"Marks":[67,56,89,57,37,86],"Class":[4,6,3,7,5,6],
     "Passed":[True,True,True,True,False,True]
    }
df=pd.DataFrame(dct)
df

     Name  Marks  Class  Passed
0  Pankaj     67      4    True
1   Kumar     56      6    True
2   Amyra     89      3    True
3  Dastur     57      7    True
4    Renu     37      5   False
5  Kumari     86      6    True

In [89]:
df.to_csv('data.csv') # A file 'data.csv' will be created

**Read excel**

In [90]:
df=pd.read_excel('data.xlsx',engine='openpyxl')
df

      Name  Class  Marks Grade
0   Pankaj      8     56     A
1    Kumar      4     78     B
2     Renu      6     46     A
3   Kumari      4     67     C
4   Shreya      7     89     A
5  Chandel      5     57     B
6    Amyra      7     87     A
7   Dastur      9     56     A

In [91]:
df=pd.read_excel('data.xlsx',engine='openpyxl',sheet_name='Sheet1')
df

      Name  Class  Marks Grade
0   Pankaj      8     56     A
1    Kumar      4     78     B
2     Renu      6     46     A
3   Kumari      4     67     C
4   Shreya      7     89     A
5  Chandel      5     57     B
6    Amyra      7     87     A
7   Dastur      9     56     A

In [92]:
df=pd.read_excel('data.xlsx',engine='openpyxl',sheet_name='Sheet2')
df

     Name2  Class2  Marks2 Grade2
0    Amyra       8      56      A
1   Dastur       4      78      B
2     Renu       6      46      A
3   Kumari       4      67      C
4   Shreya       7      89      A
5  Chandel       5      57      B
6   Pankaj       7      87      A
7    Kumar       9      56      A

**Writing to excel**

In [93]:
dct={"Name":['Pankaj','Kumar','Amyra','Dastur','Renu','Kumari'],"Marks":[67,56,89,57,37,86],"Class":[4,6,3,7,5,6],
     "Passed":[True,True,True,True,False,True]
    }
df=pd.DataFrame(dct)
df

     Name  Marks  Class  Passed
0  Pankaj     67      4    True
1   Kumar     56      6    True
2   Amyra     89      3    True
3  Dastur     57      7    True
4    Renu     37      5   False
5  Kumari     86      6    True

In [94]:
df.to_excel('data1.xlsx',sheet_name='Sheet1')

In [95]:
df.iloc[0,0]="Bad boy"
df.iloc[2,0]="Bad girl"
df

       Name  Marks  Class  Passed
0   Bad boy     67      4    True
1     Kumar     56      6    True
2  Bad girl     89      3    True
3    Dastur     57      7    True
4      Renu     37      5   False
5    Kumari     86      6    True

In [96]:
df.to_excel('data1.xlsx',sheet_name='Sheet2')

# merging data

In [106]:
dct={"Name":['Pankaj','Kumar','Amyra','Dastur','Renu','Kumari'],"Marks":[67,56,89,57,37,86],"Class":[4,6,3,7,5,6],
     "Passed":[True,True,True,True,False,True]
    }
df=pd.DataFrame(dct)
df

     Name  Marks  Class  Passed
0  Pankaj     67      4    True
1   Kumar     56      6    True
2   Amyra     89      3    True
3  Dastur     57      7    True
4    Renu     37      5   False
5  Kumari     86      6    True

In [113]:
d1=df.loc[0:2,:]
d1

     Name  Marks  Class  Passed
0  Pankaj     67      4    True
1   Kumar     56      6    True
2   Amyra     89      3    True

In [114]:
d2=df.loc[3:,:]
d1

     Name  Marks  Class  Passed
0  Pankaj     67      4    True
1   Kumar     56      6    True
2   Amyra     89      3    True

In [117]:
pd.concat([d1,d2])  # It will merge the two compatible dataframes

     Name  Marks  Class  Passed
0  Pankaj     67      4    True
1   Kumar     56      6    True
2   Amyra     89      3    True
3  Dastur     57      7    True
4    Renu     37      5   False
5  Kumari     86      6    True

**The combined pieces can be identified by assigning a key**

In [118]:
concatenated=pd.concat([d1,d2],keys=['First','Second'])
concatenated

            Name  Marks  Class  Passed
First  0  Pankaj     67      4    True
       1   Kumar     56      6    True
       2   Amyra     89      3    True
Second 3  Dastur     57      7    True
       4    Renu     37      5   False
       5  Kumari     86      6    True

**Using the keys, the pieces can be extracted back from the concatenated data**

In [123]:
concatenated.loc['First']

     Name  Marks  Class  Passed
0  Pankaj     67      4    True
1   Kumar     56      6    True
2   Amyra     89      3    True

# Groupby

In [134]:
df

     Name  Marks  Class  Passed
0  Pankaj     67      4    True
1   Kumar     56      6    True
2   Amyra     89      3    True
3  Dastur     57      7    True
4    Renu     37      5   False
5  Kumari     86      6    True

In [133]:
df['Passed'].groupby(df['Class']).sum()

Class
3    1
4    1
5    0
6    2
7    1
Name: Passed, dtype: int64